Repository: SciViews/svBase
Catalog: po/R-*.po
Languages: fr

source: `exclude.names` must be a character vector or NULL.
fr: `exclude.names` doit être un vecteur de caractères ou NULL.

source: Standard evaluation is not allowed.
fr: L'évaluation standard n'est pas autorisée.

source: If you provide a list of formulas, you cannot provide more.
fr: Si vous fournissez une liste de formules, vous ne pouvez pas en fournir d’autre par ailleurs.

source: {.arg .max.args} must be a single positive {.cls integer}, not {.max.args}.
fr: {.arg .max.args} doit être un {.cls integer} positif unique, et non {.max.args}.

source: You provided {ldots} arguments, but max allowed is {.max.args}.
fr: Vous avez fourni {ldots} arguments, alors que le maximum autorisé est de {.max.args}.

source: Macro expanded expression:
fr: Macro expression élargie :

source: You cannot mix standard evaluation and formulas.
fr: Vous ne pouvez pas mélanger l'évaluation standard et les formules.

source: All inputs must be named.
fr: Toutes les entrées doivent être nommées.

source: Use formulas instead.
fr: Utilisez plutôt des formules.

source: Argument {.arg lang} is missing or {.code NULL}.
fr: L'argument {.arg lang} est manquant ou {.code NULL}.

source: Provide a valid two-letter language code, e.g., 'en', 'fr', 'de'...
fr: Indiquez un code de langue valide à deux lettres, par exemple « en », « fr », « de »...

source: The argument {.arg lang} must be a single string.
fr: L'argument {.arg lang} doit être une chaîne unique.

source: Wrong {.arg lang} argument (must be either 'C' or a language code).
fr: Argument {.arg lang} incorrect (doit être « C » ou un code de langue).

source: Natural language support is available on this system,
fr: Ce système offre une assistance en langage naturel,

source: but unable to properly switch language.
fr: mais impossible de changer correctement de langue.

source: Argument {.arg n} must be numeric.
fr: L'argument {.arg n} doit être numérique.

source: You provided an object of class {.cls {class(n)}}.
fr: Vous avez fourni un objet de classe {.cls {class(n)}}.

source: Argument {.arg n} must be a non-negative integer.
fr: L'argument {.arg n} doit être un entier non négatif.

source: You provided: {.code {deparse(n)}}.
fr: Vous avez fourni : {.code {deparse(n)}}.

source: Argument {.arg msg1} must be a single string.
fr: L'argument {.arg msg1} doit être une chaîne unique.

source: You provided: {.code {deparse(msg1)}}.
fr: Vous avez fourni : {.code {deparse(msg1)}}.

source: This is an object of class {.cls {class(msg1)}}.
fr: Il s'agit d'un objet de la classe {.cls {class(msg1)}}.

source: This is an object of length {length(msg1)}.
fr: Il s'agit d'un objet de longueur {length(msg1)}.

source: Argument {.arg msg2} must be a single string.
fr: L'argument {.arg msg2} doit être une chaîne unique.

source: You provided: {.code {deparse(msg2)}}.
fr: Vous avez fourni : {.code {deparse(msg2)}}.

source: This is an object of class {.cls {class(msg2)}}.
fr: Il s'agit d'un objet de la classe {.cls {class(msg2)}}.

source: This is an object of length {length(msg2)}.
fr: Il s'agit d'un objet de longueur {length(msg2)}.

source: Test of svBase's `gettext()` and `gettextf()`:
fr: Test des fonctions `gettext()` et `gettextf()` de svBase :

source: This should be transtlated, if '%s' language is supported.
fr: Ceci doit être traduit si la langue '%s' est prise en charge.

source: This is message number %i
fr: Il s'agit du message numéro %i

source: cannot assign a list to be a object label
fr: impossible d’assigner une liste comme label d’un objet

source: {.arg label} must be {.cls character} of length 1
fr: {.arg label} doit être {.cls character} de longueur 1

source: x must be a data.frame
fr: x doit être un data.frame

source: Impossible to label variables of a {.cls data.frame} with no columns
fr: Impossible de libeller les variables d'un {.cls data.frame} sans colonnes

source: {.arg label} as unnamed {.cls list} must have the same length as {.arg x}
fr: {.arg label} comme {.cls list} non nommée doit avoir la même longueur que {.arg x}

source: The following label names are not in {.arg x}:
fr: Les noms de labels suivants ne figurent pas dans {.arg x} :

source: {.arg units} must be a {.cls list} or {.cls character} of same length as {.arg x}
fr: {.arg units} doit être une {.cls list} ou un {.cls character} de même longueur que {.arg x}

source: {.arg units} as unnamed {.cls list} must have the same length as {.arg x}
fr: {.arg units} comme {.cls list} non nommée doit avoir la même longueur que {.arg x}

source: The following units names are not in {.arg x}:
fr: Les noms d'unités suivants ne figurent pas dans {.arg x} :

source: {.arg x} must be a {.cls data.frame}
fr: {.arg x} doit être un {.cls data.frame}

source: Column {.var {col}} not found in {.arg x}
fr: Colonne {.var {col}} introuvable dans {.arg x}

source: Column number {.var {col}} out of range in {.arg x}
fr: Numéro de colonne {.var {col}} hors limites dans {.arg x}

source: Column specifier must be either {.cls character} or {.cls numeric}
fr: La spécification de colonne doit être soit {.cls caractère}, soit {.cls numérique}.

source: `%s` must be a 'data.frame'.
fr: `%s` doit être un "data.frame".

source: Implicit data-dot (.) not permitted
fr: Mécanisme « data-dot » implicite (.) pas autorisé

source: Data-dot mechanism activated, but no `.` object found.
fr: Le mécanisme « data-dot » est activé, mais aucun objet `.` n'a été trouvé.

source: {.code {deparse(call0)}} rewritten as: {.code {deparse(call)}}
fr: {.code {deparse(call0)}} réécrit comme suit : {.code {deparse(call)}}

source: Define `.` before this call, or provide `%s =` explicitly.
fr: Définissez `.` avant d'appeler cette fonction, ou fournissez `%s=` explicitement.

source: See {.help svBase::data_dot_mechanism} for more infos.
fr: Voir {.help svBase::data_dot_mechanism} pour plus d'informations.

source: `%s` and `%s` must both be 'data.frame'.
fr: `%s` et `%s` doivent tous deux être des "data.frame".

source: You must provide .data
fr: Vous devez fournir des données .data

source: You must provide new_name = old_name (all named arguments)
fr: Vous devez fournir new_name = old_name (tous les arguments nommés)

source: Arguments and argument names do not match
fr: Les arguments et les noms d'arguments ne correspondent pas

source: This should not be called directly, see ?mutate_with.
fr: Elle ne doit pas être appelée directement, voir ?mutate_with.

source: Only supporting .cols = everything() for now, sorry.
fr: Pour l'instant, nous ne prenons en charge que .cols = everything(), désolé.

source: Can only rename with a function for now, sorry.
fr: Pour l'instant, on ne peut renommer qu'avec une fonction, désolé.

source: This argument is here only for compatibility with full_join() but it does nothing here.
fr: Cet argument n'est présent que pour des raisons de compatibilité avec full_join(), mais il ne fait rien ici.

source: This argument is here only for compatibility with left_join() but it does nothing here.
fr: Cet argument n'est présent que pour des raisons de compatibilité avec left_join(), mais il ne fait rien ici.

source: This argument is here only for compatibility with right_join() but it does nothing here.
fr: Cet argument n'est présent que pour des raisons de compatibilité avec right_join(), mais il ne fait rien ici.

source: This argument is here only for compatibility with inner_join() but it does nothing here.
fr: Cet argument n'est présent que pour des raisons de compatibilité avec inner_join(), mais il ne fait rien ici.

source: `.id` must be a scalar string
fr: `.id` doit être une chaîne scalaire

source: .drop = FALSE not implemented yet in scount(), use count() instead
fr: .drop = FALSE pas encore implémenté dans scount(), utiliser count() à la place

source: scount() does not use computed values for ... yet, use count() instead
fr: scount() n'utilise pas encore les valeurs calculées pour ..., utilisez count() à la place

source: 'wt' must be same length as the number of rows in 'x', or the name of a column in 'x'
fr: wt" doit être de la même longueur que le nombre de lignes dans "x" ou que le nom d'une colonne dans "x"

source: the .drop= argument is deprecated in (s)add_count()
fr: l'argument .drop= est obsolète dans (s)add_count()

source: sadd_count() does not use computed values for ... yet, use add_count() instead
fr: sadd_count() n'utilise pas encore les valeurs calculées pour ..., utilisez plutôt add_count()

source: You must collect results from a tidy function before using a speedy one.
fr: Vous devez collecter les résultats d'une fonction ’tidy’ avant d'utiliser une fonction ‘speedy’.

source: {.emph The data-dot mechanism was activated}
fr: {.emph Le mécanisme « data-dot » a été activé

source: (see {.help svBase::data_dot_mechanism}).
fr: (voir {.help svBase::data_dot_mechanism} ).

source: {.emph {.code .} is {object_info(.)}}
fr: {.emph {.code .} est {object_info(.)}}

source: a data frame with %d rows and %d columns: %s
fr: un data frame avec %d lignes et %d colonnes : %s

source: a list with %d elements
fr: une liste avec %d éléments

source: a vector of type '%s' and %d elements
fr: un vecteur de type '%s' et %d éléments

source: an object of class '%s'
fr: un objet de classe "%s"

source: Type {.code {type}} not found for function {.fun {fun_str}}
fr: Type {.code {type}} non trouvé pour la fonction {.fun {fun_str}}

source: No type found for this function.
fr: Aucun type n'a été trouvé pour cette fonction.

source: Known types: {types}.
fr: Types connus : {types}.

source: You asked for only one item
fr: Vous n'avez demandé qu'un seul item
